In [1]:
import pandas as pd
df=pd.read_csv("bengaluru_house_prices.csv")
df.head(3)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00

In [6]:
df["area_type"].unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [8]:
df2=df.drop(["area_type","availability","location","society","price"],axis="columns")
df2.head(3)

        size total_sqft  bath  balcony
0      2 BHK       1056   2.0      1.0
1  4 Bedroom       2600   5.0      3.0
2      3 BHK       1440   2.0      3.0

In [9]:
df2["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [10]:
df2["bath"].unique()

array([ 2.,  5.,  3.,  4.,  6.,  1.,  9., nan,  8.,  7., 11., 10., 14.,
       27., 12., 16., 40., 15., 13., 18.])

In [11]:
df2["balcony"].unique()

array([ 1.,  3., nan,  2.,  0.])

In [12]:
df2["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [19]:
df2["size"].dropna()

0            2 BHK
1        4 Bedroom
2            3 BHK
3            3 BHK
4            2 BHK
           ...
13315    5 Bedroom
13316        4 BHK
13317        2 BHK
13318        4 BHK
13319        1 BHK
Name: size, Length: 13304, dtype: object

In [29]:
df2["size"]

0            2 BHK
1        4 Bedroom
2            3 BHK
3            3 BHK
4            2 BHK
           ...
13315    5 Bedroom
13316        4 BHK
13317        2 BHK
13318        4 BHK
13319        1 BHK
Name: size, Length: 13320, dtype: object

In [40]:
# First Converting BHK into Numbers by using split function
df2['bhk'] = df2['size'].astype(str).apply( lambda x: x.split(" ")[0])
df2

            size total_sqft  bath  balcony bhk
0          2 BHK       1056   2.0      1.0   2
1      4 Bedroom       2600   5.0      3.0   4
2          3 BHK       1440   2.0      3.0   3
3          3 BHK       1521   3.0      1.0   3
4          2 BHK       1200   2.0      1.0   2
...          ...        ...   ...      ...  ..
13315  5 Bedroom       3453   4.0      0.0   5
13316      4 BHK       3600   5.0      NaN   4
13317      2 BHK       1141   2.0      1.0   2
13318      4 BHK       4689   4.0      1.0   4
13319      1 BHK        550   1.0      1.0   1

[13320 rows x 5 columns]

In [43]:
df3=df2.drop(["size"],axis="columns")
df3

      total_sqft  bath  balcony bhk
0           1056   2.0      1.0   2
1           2600   5.0      3.0   4
2           1440   2.0      3.0   3
3           1521   3.0      1.0   3
4           1200   2.0      1.0   2
...          ...   ...      ...  ..
13315       3453   4.0      0.0   5
13316       3600   5.0      NaN   4
13317       1141   2.0      1.0   2
13318       4689   4.0      1.0   4
13319        550   1.0      1.0   1

[13320 rows x 4 columns]

In [44]:
df4=df3.dropna()

In [45]:
df4.isna().sum()

total_sqft    0
bath          0
balcony       0
bhk           0
dtype: int64

In [47]:
def to_convert_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [63]:
def to_convert_into_avg(x):
    token=x.split("-")
    if len(token)==2:
        return (float(token[0])+float(token[1]))/2
    try:
        return float(x)
    except:
        return None

In [64]:
to_convert_into_avg("2-2")

2.0

In [65]:
df5=df4.copy()

In [66]:
df5["total_sqft"]=df5["total_sqft"].apply(to_convert_into_avg)

In [68]:
df5["total_sqft"].unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [70]:
df5.bhk.unique()

array(['2', '4', '3', '1', '6', '8', '7', '5', '11', '9', '27', '43',
       '14', '12', '10', '13'], dtype=object)